//  ця мідлвара виконує кілька задач:
// 1. перевіряє валідність токена, тобто що ми його видали та що його термін не витік
// 2. витягує з токена айді, знаходить в базі користувача по айді і прикріплює його до запиту (рег.юзер)
// таким чином в любому контролері інфор про того хто питає буде доступна

const { Unauthorized } = require("http-errors");

const jwt = require("jsonwebtoken");

const { User } = require("../models");
// витягуємо секретний ключ щоб розшифрувати токен
const { SECRET_KEY } = process.env;

const auth = async (req, res, next) => {
  // витягуємо заголовок - всі заголовки зберігаються в реквест хедерс - з малеенької літери
  // якщо його не передали, (то викине андефайнд, до нього не можна застосуввати спліт, тому буде помилка),  -присваюємо пустий рядок
  const { authorization = "" } = req.headers;
  // тепер цей рядок треба розділити на 2 частини по пробелу, для цого використовуємо спліт
  const [bearer, token] = authorization.split(" ");

  try {
    // робимо перевірку на слово берер
    if (bearer !== "Bearer") {
      throw new Unauthorized("Not authorized");
    }
    // перевірка токена за допомогою метода веріфай
    // якщо він є, то знаходимо користувача в базі
    const { id } = jwt.verify(token, SECRET_KEY);
    const user = await User.findById(id);
    // дописуємо ще перевірку - якщо користувач був, але розлогінився, тобто його токен став нал, то викидаємо помилку
    if (!user || !user.token) {
      throw new Unauthorized("Not authorized");
    }
    //  якщо є  - прикріпляємо в реквест юзер - юзера і передаємо управління далі - некст
    req.user = user;
    next();
  } catch (error) {
    if (error.message === "Invalid sugnature") {
      error.status = 401;
    }
    next(error);
  }
};
module.exports = auth;
// цю мідлвару можна імпортувати в будь=яке місце, таким чином ми отримаємо приватний роутер
